#+TITLE: Supabase integration notes
#+AUTHOR: Cormac Cannon
#+EMAIL: cormac.cannon@neuromoddevices.com
#+LANGUAGE: en
#+COPYRIGHT: Neuromod Devices Ltd. 2025
#+DATE: 2025-01-23


# EXPORT SETUP

# 1. Ensure exports include both source block contents and any results
#+PROPERTY: header-args :exports both

# 2. Suppress author in title, and prevent ^ and _ from initiating super and subscript....
#     N.B. can still use the braced forms -- i.e. 'bla^{super}_{sub}'
#+OPTIONS: author:nil ^:nil

# 3. HTML export theme
#+SETUPFILE: ~/Documents/templates/org-html-themes/org/theme-readtheorg.setup

# 4. ODT (and DOCX) export styles/theme
#    N.B. Editing the ODT can cause the embedded logo jpg name to change... if this occurs, unzip the odt to check the new name and update this line
#+ODT_STYLES_FILE: ("~/Documents/templates/nmd-template.odt" ("styles.xml" "content.xml" "Pictures/1000000000000A4F000004659ACFB30B1A81D55F.jpg"))


# Startup options : Want to view rendered versions of latex fragments (equations etc.) by default
#+STARTUP:: latexpreview


Some introductory text

** Pull supabase URL and API key from environment
Some preliminary work has been done here to extract runtime info (API key etc.) from your locally running (dockerised) instance of supabase.

See [[./supabase-env.clj]]

This parses the CLI output of 'supabase status' and generates an [[./env-local.edn]] file (which is git-ignored -- i.e. the link to the left is non-functional until you've run the command locally to generate the file).

A yarn task has been created to generate/update your local instance:
#+begin_src sh :results verbatim
  yarn sync-local-env
#+end_src

#+RESULTS:
#+begin_example
yarn run v1.22.22
$ ./supabase-env.clj
"Extracting local superbase environment info:"
{:studio-url "http://127.0.0.1:54323",
 :graphql-url "http://127.0.0.1:54321/graphql/v1",
 :s3-access-key "625729a08b95bf1b7ff351a663f3a23c",
 :db-url "postgresql://postgres:postgres@127.0.0.1:54322/postgres",
 :service_role-key
 "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImV4cCI6MTk4MzgxMjk5Nn0.EGIM96RAZx35lJzdJsyH-qQwv8Hdp7fsn3W0YpN81IU",
 :api-url "http://127.0.0.1:54321",
 :inbucket-url "http://127.0.0.1:54324",
 :s3-region "local",
 :anon-key
 "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0",
 :jwt-secret "super-secret-jwt-token-with-at-least-32-characters-long",
 :s3-secret-key
 "850181e4652dd023b7a98c58ae0d2d34bd487ee0cc3254aed6eda37307425907",
 :s3-storage-url "http://127.0.0.1:54321/storage/v1/s3"}
"Overriding closure-defines -> env-local.edn"
{:closure-defines
 #:stack.utils.supabase{:API-URL "http://127.0.0.1:54321",
                        :ANON-KEY
                        "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0"}}
Done in 0.37s.
#+end_example




** Starting local development environment
#+begin_src shell :results verbatim
  supabase start
#+end_src

#+RESULTS:
#+begin_example
         API URL: http://127.0.0.1:54321
     GraphQL URL: http://127.0.0.1:54321/graphql/v1
  S3 Storage URL: http://127.0.0.1:54321/storage/v1/s3
          DB URL: postgresql://postgres:postgres@127.0.0.1:54322/postgres
      Studio URL: http://127.0.0.1:54323
    Inbucket URL: http://127.0.0.1:54324
      JWT secret: super-secret-jwt-token-with-at-least-32-characters-long
        anon key: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0
service_role key: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImV4cCI6MTk4MzgxMjk5Nn0.EGIM96RAZx35lJzdJsyH-qQwv8Hdp7fsn3W0YpN81IU
   S3 Access Key: 625729a08b95bf1b7ff351a663f3a23c
   S3 Secret Key: 850181e4652dd023b7a98c58ae0d2d34bd487ee0cc3254aed6eda37307425907
       S3 Region: local
#+end_example

** Get status of running environment
#+begin_src shell :results verbatim
  supabase status
#+end_src

#+RESULTS:
#+begin_example
         API URL: http://127.0.0.1:54321
     GraphQL URL: http://127.0.0.1:54321/graphql/v1
  S3 Storage URL: http://127.0.0.1:54321/storage/v1/s3
          DB URL: postgresql://postgres:postgres@127.0.0.1:54322/postgres
      Studio URL: http://127.0.0.1:54323
    Inbucket URL: http://127.0.0.1:54324
      JWT secret: super-secret-jwt-token-with-at-least-32-characters-long
        anon key: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0
service_role key: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImV4cCI6MTk4MzgxMjk5Nn0.EGIM96RAZx35lJzdJsyH-qQwv8Hdp7fsn3W0YpN81IU
   S3 Access Key: 625729a08b95bf1b7ff351a663f3a23c
   S3 Secret Key: 850181e4652dd023b7a98c58ae0d2d34bd487ee0cc3254aed6eda37307425907
       S3 Region: local
#+end_example

